<template>
  <v-card>
    <v-toolbar
      flat
      color="blue-grey"
      dark
    >
      <v-toolbar-title>W3W - ランダム場所検索</v-toolbar-title>
    </v-toolbar>

    <v-card-text>
      <v-row>
        <v-col class="text-center">
          <v-btn
            text
            color="red"
            v-text="'新しいワードを生成'"
            @click="Geet"
          />
        </v-col>
      </v-row>
      <v-row justify="space-around">
        <v-col
          cols="12"
          xs="10"
          sm="8"
          md="4"
          lg="3"
          xl="2"
          v-for="(w,i) in wordList"
          :key="i"
        >
          <v-card elevation="1">

            <v-list subheader>
              <v-list-item>
                <v-list-item-content>
                  <v-list-item-title>{{ i + 1 }}文字目： {{ w }}</v-list-item-title>
                </v-list-item-content>
              </v-list-item>

            </v-list>
          </v-card>

        </v-col>
      </v-row>

      <v-row>
        <v-col class="text-center">
          <v-btn
            text
            color="blue"
            v-text="'W3Wのリンクを開く'"
            @click="Oppen"
          />
        </v-col>
      </v-row>

    </v-card-text>

  </v-card>
</template>

<script>
export default {
  name: 'Home',
  computed: {
    //
  },
  mounted: function () {
    //
  },
  data: () => ({
    // textVal: null,
    // textCount: 0,
    // textRCount: 0,
    // textECount: 0
    wordList: ['わたし', 'かれ', 'かのじょ'],
    wordDict: ['わたし', 'あなた', 'ひと', 'かた', 'じん', 'みなさん', 'さん', 'せんせい', 'きょうし', 'がくせい', 'しゃいん', 'いしゃ', 'だいがく', 'でんき', 'だれ', 'さい', 'なんさい', 'おいくつ', 'はい', 'いいえ', 'アメリカ', 'イギリス', 'インド', 'タイ', 'かんこく', 'ドイツ', 'フランス', 'ブラジル', 'これ', 'それ', 'あれ', 'この', 'その', 'あの', 'ほん', 'じしょ', 'ざっし', 'しんぶん', 'ノート', 'てちょう', 'めいし', 'カード', 'えんぴつ', 'かぎ', 'とけい', 'かさ', 'かばん', 'テレビ', 'ラジオ', 'カメラ', 'つくえ', 'いす', 'コーヒー', 'えいご', 'にほんご', 'ご', 'なん', 'そうです', 'あのう', 'どうぞ', 'どうも', 'ここ', 'そこ', 'あそこ', 'どこ', 'こちら', 'そちら', 'あちら', 'どちら', 'じむしょ', 'うけつけ', 'ロビー', 'へや', 'トイレ', 'かいだん', 'おくに', 'かいしゃ', 'うち', 'でんわ', 'くつ', 'ネクタイ', 'ワイン', 'たばこ', 'うりば', 'ちか', 'かい', 'なんがい', 'えん', 'いくら', 'ひゃく', 'せん', 'まん', 'じゃ', 'ください', 'イタリア', 'スイス', 'デパート', 'ぎんこう', 'いま', 'じ', 'ふん', 'はん', 'なんじ', 'なんぷん', 'ごぜん', 'ごご', 'あさ', 'ひる', 'よる', 'ばん', 'おととい', 'きのう', 'きょう', 'あした', 'あさって', 'けさ', 'こんばん', 'さくばん', 'やすみ', 'まいあさ', 'まいばん', 'まいにち', 'かようび', 'どようび', 'ばんごう', 'なんばん', 'から', 'まで', 'と', 'おきます', 'ねます', 'ええと', 'いきます', 'きます', 'がっこう', 'スーパー', 'えき', 'ひこうき', 'ふね', 'でんしゃ', 'ちかてつ', 'バス', 'タクシー', 'あるいて', 'ひと', 'ともだち', 'かれ', 'かのじょ', 'かぞく', 'ひとりで', 'せんげつ', 'こんげつ', 'らいげつ', 'きょねん', 'ことし', 'らいねん', 'がつ', 'なんがつ', 'にち', 'なんにち', 'いつ', 'ふつう', 'つぎ', 'ばんせん', 'すいます', 'かいます', 'あいます', 'ききます', 'かきます', 'のみます', 'よみます', 'とります', 'たべます', 'みます', 'します', 'ごはん', 'パン', 'たまご', 'にく', 'さかな', 'やさい', 'くだもの', 'みず', 'おちゃ', 'こうちゃ', 'ミルク', 'ジュース', 'ビール', 'おさけ', 'ビデオ', 'えいが', 'CD', 'てがみ', 'レポート', 'しゃしん', 'みせ', 'にわ', 'テニス', 'サッカー', 'おはなみ', 'なに', 'ちょっと', 'いつも', 'ときどき', 'それから', 'ええ', 'メキシコ', 'かします', 'きります', 'かけます', 'あげます', 'かります', 'けしゴム', 'て', 'はし', 'スプーン', 'ナイフ', 'フォーク', 'はさみ', 'ワープロ', 'パンチ', 'パソコン', 'かみ', 'はな', 'シャツ', 'にもつ', 'おかね', 'きっぷ', 'ちち', 'はは', 'もう', 'まだ', 'これから', 'りょこう', 'おみやげ', 'スペイン', 'きれいな', 'しずかな', 'げんきな', 'ひまな', 'べんりな', 'すてきな', 'おおきい', 'ちいさい', 'ふるい', 'いい', 'わるい', 'あつい', 'あつい', 'さむい', 'つめたい', 'やさしい', 'たかい', 'やすい', 'ひくい', 'おいしい', 'たのしい', 'しろい', 'くろい', 'あかい', 'あおい', 'くるま', 'さくら', 'やま', 'まち', 'たべもの', 'ところ', 'りょう', 'せいかつ', 'しごと', 'どう', 'どんな', 'どれ', 'とても', 'あまり', 'そして', 'なれます', 'けっこう', 'そろそろ', 'あります', 'すきな', 'きらいな', 'へたな', 'りょうり', 'のみもの', 'スポーツ', 'やきゅう', 'ダンス', 'おんがく', 'うた', 'ジャズ', 'カラオケ', 'かぶき', 'え', 'じ', 'かんじ', 'ひらがな', 'かたかな', 'ローマじ', 'チケット', 'じかん', 'ようじ', 'やくそく', 'おっと', 'しゅじん', 'おくさん', 'つま', 'かない', 'こども', 'よく', 'だいたい', 'たくさん', 'すこし', 'ぜんぜん', 'はやく', 'から', 'どうして', 'もしもし', 'ああ', 'ちょっと', 'あります', 'います', 'いぬ', 'ねこ', 'き', 'もの', 'フィルム', 'でんち', 'はこ', 'スイッチ', 'テーブル', 'ベッド', 'たな', 'ドア', 'まど', 'ポスト', 'ビル', 'こうえん', 'ほんや', 'や', 'のりば', 'けん', 'うえ', 'した', 'まえ', 'うしろ', 'みぎ', 'ひだり', 'なか', 'そと', 'となり', 'ちかく', 'あいだ', 'や', 'いちばん', 'だんめ', 'おく', 'います', 'います', 'ねん', 'つ', 'いくつ', 'にん', 'だい', 'まい', 'かい', 'りんご', 'みかん', 'きって', 'はがき', 'ふうとう', 'そくたつ', 'かきとめ', 'ふなびん', 'あに', 'あね', 'おとうと', 'いもうと', 'がいこく', 'じかん', 'かげつ', 'ぐらい', 'ぜんぶで', 'みんな', 'だけ', 'それから', 'ちかい', 'とおい', 'はやい', 'はやい', 'おそい', 'おおい', 'すくない', 'すずしい', 'あまい', 'からい', 'おもい', 'かるい', 'いい', 'きせつ', 'はる', 'なつ', 'あき', 'ふゆ', 'てんき', 'あめ', 'ゆき', 'くもり', 'ホテル', 'くうこう', 'うみ', 'せかい', 'まつり', 'しけん', 'すきやき', 'さしみ', 'すし', 'てんぷら', 'いけばな', 'もみじ', 'どちら', 'どちらも', 'ずっと', 'はじめて', 'ただいま', 'でも', 'だします', 'でます', 'ほしい', 'さびしい', 'ひろい', 'せまい', 'スキー', 'プール', 'かわ', 'けいざい', 'びじゅつ', 'つり', 'かいぎ', 'とうろく', 'ごろ', 'なにか', 'どこか', 'けします', 'まちます', 'もちます', 'よびます', 'とります', 'ふります', 'つけます', 'あけます', 'みせます', 'しめます', 'とめます', 'エアコン', 'なまえ', 'ちず', 'しお', 'さとう', 'かた', 'ゆっくり', 'すぐ', 'また', 'あとで', 'もう', 'まっすぐ', 'おつり', 'おきます', 'たちます', 'すみます', 'うります', 'しります', 'しりょう', 'カタログ', 'ふく', 'せいひん', 'ソフト', 'せんもん', 'はいしゃ', 'とこや', 'どくしん', 'とくに', 'こうこう', 'だします', 'おします', 'のります', 'でます', 'あびます', 'やめます', 'おります', 'いれます', 'わかい', 'ながい', 'みじかい', 'あかるい', 'くらい', 'からだ', 'あたま', 'かみ', 'かお', 'め', 'みみ', 'くち', 'は', 'おなか', 'あし', 'サービス', 'シャワー', 'みどり', 'てら', 'じんじゃ', 'ばん', 'どの', 'まず', 'つぎに', 'きんがく', 'かくにん', 'ボタン', 'ベトナム', 'アジア', 'ぬぎます', 'だします', 'のみます', 'あぶない', 'もんだい', 'こたえ', 'きんえん', 'かぜ', 'ねつ', 'びょうき', 'くすり', 'ふろ', 'うわぎ', 'したぎ', 'せんせい', 'までに', 'ですから', 'いたい', 'のど', 'ひきます', 'かえます', 'できます', 'すてます', 'ピアノ', 'メートル', 'こくさい', 'げんきん', 'しゅみ', 'にっき', 'いのり', 'ぶちょう', 'かちょう', 'どうぶつ', 'うま', 'へえ', 'なかなか', 'ほんとう', 'ぜひ', 'なります', 'ねむい', 'つよい', 'よわい', 'むりな', 'ちょうし', 'ゴルフ', 'すもう', 'パチンコ', 'ひ', 'いちど', 'いちども', 'だんだん', 'もうすぐ', 'かんぱい', 'じつは', 'しかし', 'ケーキ', 'いります', 'ぼく', 'きみ', 'くん', 'うん', 'ううん', 'ことば', 'ぶっか', 'きもの', 'はじめ', 'おわり', 'こっち', 'そっち', 'あっち', 'どっち', 'みんなで', 'の', 'かな', 'けど', 'いいます', 'かちます', 'あります', 'まけます', 'たります', 'ふべんな', 'すごい', 'おなじ', 'せいじ', 'ニュース', 'スピーチ', 'しあい', 'いけん', 'はなし', 'ユーモア', 'むだな', 'デザイン', 'こうつう', 'ラッシュ', 'さいきん', 'たぶん', 'きっと', 'ついて', 'しばらく', 'もちろん', 'はきます', 'きます', 'かけます', 'コート', 'スーツ', 'セーター', 'めがね', 'ぼうし', 'やちん', 'うーん', 'わしつ', 'おしいれ', 'ふとん', 'アパート', 'ききます', 'ひきます', 'かえます', 'でます', 'でんきや', 'サイズ', 'おと', 'きかい', 'つまみ', 'こしょう', 'みち', 'しんごう', 'かど', 'はし', 'め', 'たてもの', 'とき', 'くれます', 'いれます', 'じゅんび', 'いみ', 'かし', 'ぜんぶ', 'じぶんで', 'ほかに', 'べんとう', 'ははのひ', 'つきます', 'とります', 'いなか', 'グループ', 'チャンス', 'おく', 'てんきん', 'こと', 'やります', 'みます', 'だします', 'もえます', 'ばしょ', 'べん', 'こんど', 'ずいぶん', 'いつでも', 'どこでも', 'だれでも', 'なんでも', 'こんな', 'そんな', 'あんな', 'よこ', 'ごみ', 'おきば', 'びん', 'かん', 'おゆ', 'ガス', 'うちゅう', 'こわい', 'べつの', 'かいます', 'とります', 'みえます', 'できます', 'たてます', 'つけます', 'とびます', 'ペット', 'とり', 'こえ', 'なみ', 'はなび', 'けしき', 'ひるま', 'むかし', 'どうぐ', 'ご', 'しか', 'ほかの', 'はっきり', 'ほとんど', 'ほんだな', 'ゆめ', 'いつか', 'いえ', 'ふしぎな', 'ポケット', 'まんが', 'かたち', 'ロボット', 'たとえば', 'そら', 'じぶん', 'じゆうに', 'かみます', 'うれます', 'まじめな', 'やさしい', 'えらい', 'けいけん', 'ちから', 'にんき', 'かたち', 'いろ', 'あじ', 'ガム', 'しなもの', 'ねだん', 'ボーナス', 'ばんぐみ', 'ドラマ', 'かしゅ', 'むすこ', 'むすめ', 'じぶん', 'しばらく', 'たいてい', 'それに', 'それで', 'かいわ', 'おしらせ', 'ひにち', 'むりょう', 'あきます', 'つきます', 'すきます', 'つきます', 'こみます', 'きえます', 'われます', 'おれます', 'さします', 'さら', 'がわ', 'ちゃわん', 'コップ', 'ガラス', 'ふくろ', 'さいふ', 'えだ', 'えきいん', 'このへん', 'ポケット', 'あみだな', 'たしか', 'じしん', 'かべ', 'えきまえ', 'ほう', 'はり', 'はります', 'うえます', 'かけます', 'きめます', 'げんかん', 'ろうか', 'かがみ', 'ひきだし', 'おこさん', 'こうぎ', 'よてい', 'おしらせ', 'ポスター', 'ごみばこ', 'かびん', 'かべ', 'いけ', 'こうばん', 'まだ', 'ほど', 'まわり', 'まんなか', 'すみ', 'きぼう', 'まるい', 'つき', 'ある', 'ちきゅう', 'いやな', 'すると', 'さめます', 'うれしい', 'うけます', 'とじます', 'さくぶん', 'そうしき', 'しき', 'ほんしゃ', 'ししゃ', 'おんせん', 'だれか', 'ほう', 'ずっと', 'つきに', 'ふつうの', 'むら', 'いやな', 'そら', 'とかい', 'じゆうに', 'しぜん', 'ふきます', 'ひきます', 'やみます', 'はれます', 'おかしい', 'うるさい', 'やけど', 'けが', 'せき', 'そら', 'たいよう', 'ほし', 'つき', 'かぜ', 'ゆうがた', 'きた', 'ひがし', 'みなみ', 'にし', 'すいどう', 'エンジン', 'チーム', 'こんや', 'まえ', 'おそく', 'こんなに', 'そんなに', 'あんなに', 'い', 'ストレス', 'おうしざ', 'れんあい', 'かねもち', 'にげます', 'なげます', 'あげます', 'さげます', 'だめな', 'せき', 'ファイト', 'マーク', 'ボール', 'き', 'きそく', 'いりぐち', 'でぐち', 'むりょう', 'ちゅう', 'どういう', 'もう', 'あと', 'そりゃあ', 'いない', 'けいさつ', 'ばっきん', 'でんぽう', 'ひとびと', 'うちます', 'みじかく', 'たとえば', 'きとく', 'あす', 'るす', 'るすばん', 'かなしみ', 'おります', 'つけます', 'します', 'ほそい', 'ふとい', 'にがい', 'きいろ', 'ちゃいろ', 'かぐ', 'キー', 'ず', 'せん', 'やじるし', 'くろ', 'しろ', 'あか', 'あお', 'こん', 'しょうゆ', 'ソース', 'ゆうべ', 'さっき', 'さどう', 'たてます', 'さきに', 'のせます', 'ぶん', 'こ', 'たまねぎ', 'なべ', 'かけます', 'にます', 'にえます', 'どんぶり', 'さきます', 'つけます', 'らくな', 'ただしい', 'くわしい', 'かいがい', 'もっと', 'かた', 'むこう', 'しま', 'むら', 'みなと', 'きんじょ', 'きかい', 'きょか', 'まる', 'そうさ', 'ほうほう', 'せつび', 'カーテン', 'ひも', 'ふた', 'は', 'きょく', 'たのしみ', 'はじめに', 'はこね', 'にっこう', 'はくば', 'アフリカ', 'それなら', 'くさつ', 'しゅ', 'ことわざ', 'うちます', 'すぎます', 'やせます', 'でます', 'なれます', 'かたい', 'まいつき', 'でんし', 'けいたい', 'けんこう', 'けんどう', 'やっと', 'かなり', 'かならず', 'このごろ', 'ずつ', 'ショパン', 'すいえい', 'タンゴ', 'きもち', 'のりもの', 'れきし', 'せいき', 'とおく', 'きしゃ', 'きせん', 'とびます', 'ふみます', 'とります', 'ほめます', 'ごうかな', 'こめ', 'むぎ', 'せきゆ', 'デート', 'どろぼう', 'けいかん', 'まんが', 'によって', 'じゅう', 'ドミニカ', 'ぎじゅつ', 'とち', 'そうおん', 'アクセス', 'ほります', 'なかま', 'そのあと', 'ねずみ', 'きります', 'かけます', 'いれます', 'さつ', 'うそ', 'おおきな', 'ちいさな', 'えきまえ', 'かいがん', 'しょるい', 'でんげん', 'せい', 'おさきに', 'かいらん', 'きちんと', 'という', 'はんこ', 'おします', 'ふたご', 'しまい', 'ねんせい', 'せいかく', 'たちます', 'てん', 'しにます', 'やけます', 'じゃまな', 'きたない', 'うれしい', 'かなしい', 'じしん', 'たいふう', 'かじ', 'じこ', 'おみあい', 'だい', 'フロント', 'ごうしつ', 'あせ', 'タオル', 'せっけん', 'おおぜい', 'トラック', 'おとな', 'ようふく', 'いまでは', 'あいます', 'よいます', 'きけんな', 'うちゅう', 'ちきゅう', 'にじかい', 'たいかい', 'マラソン', 'おもて', 'うら', 'へんじ', 'まちがい', 'きず', 'ズボン', 'ながさ', 'おもさ', 'たかさ', 'おおきさ', 'びん', 'ごう', 'こ', 'ほん', 'はい', 'グラム', 'キロ', 'センチ', 'ミリ', 'いじょう', 'いか', 'さあ', 'ゴッホ', 'クラス', 'テスト', 'せいせき', 'ところで', 'ようす', 'じけん', 'ばくだん', 'つみます', 'はなれた', 'はんにん', 'いまでも', 'よびます', 'やります', 'かわいい', 'おいわい', 'おみまい', 'きょうみ', 'ぶんぽう', 'さる', 'えさ', 'おもちゃ', 'えほん', 'えはがき', 'ハンカチ', 'くつした', 'てぶくろ', 'ゆびわ', 'バッグ', 'そふ', 'そぼ', 'まご', 'おじ', 'おば', 'おじさん', 'おじさん', 'おばさん', 'おばさん', 'おととし', 'はあ', 'せんじつ', 'おとこ', 'かめ', 'しろ', 'りく', 'すると', 'けむり', 'なかみ', 'まぜます', 'あつい', 'うすい', 'セット', 'べんごし', 'れきし', 'ぶんか', 'しゃかい', 'ほうりつ', 'せんそう', 'へいわ', 'もくてき', 'あんぜん', 'ろんぶん', 'かんけい', 'ミキサー', 'やかん', 'せんぬき', 'かんづめ', 'ふろしき', 'そろばん', 'いし', 'データ', 'ファイル', 'ある', 'なぜ', 'こくれん', 'ローン', 'あと', 'なべ', 'ちょうさ', 'カップ', 'また', 'へります', 'ふえます', 'おちます', 'きれます', 'とれます', 'へんな', 'うまい', 'まずい', 'ガソリン', 'ひ', 'だんぼう', 'れいぼう', 'センス', 'いまにも', 'わあ', 'かいいん', 'ねんれい', 'ぴったり', 'そのうえ', 'ばら', 'ドライブ', 'なきます', 'おきます', 'ぬれます', 'こまかい', 'こい', 'うすい', 'くうき', 'なみだ', 'わしょく', 'おかず', 'りょう', 'ばい', 'シングル', 'ツイン', 'たんす', 'りゆう', 'カット', 'ショート', 'みたいに', 'たとえば', 'これら', 'えんぎ', 'はんぶん', 'あいます', 'キャンプ', 'かかり', 'ちゅうし', 'てん', 'レバー', 'さつ', 'ちゃんと', 'きゅうに', 'コース', 'スタート', 'い', 'なやみ', 'さめます', 'かいとう', 'なります', 'それでも', 'やきます', 'でます', 'るす', 'げんいん', 'ステレオ', 'ちょうど', 'ぐあい', 'ちしき', 'ほうこ', 'システム', 'びょう', 'でます', 'さします', 'します', 'ひどい', 'こわい', 'だんせい', 'じょせい', 'こいびと', 'じっけん', 'じんこう', 'におい', 'かがく', 'いがく', 'ぶんがく', 'パトカー', 'さんせい', 'はんたい', 'どうも', 'によると', 'バリとう', 'イラン', 'グアム', 'あいて', 'はかせ', 'のう', 'ホルモン', 'けしょう', 'しらべ', 'いやな', 'きびしい', 'じゅく', 'せいと', 'もの', 'じゆうに', 'かん', 'もともと', 'せいき', 'スピード', 'サーカス', 'げい', 'すがた', 'こころ', 'にとって', 'よります', 'かけます', 'たまに', 'あいさつ', 'はいざら', 'りょかん', 'バスてい', 'ぼうえき', 'さま', 'かえりに', 'ちっとも', 'ねん', 'くみ', 'では', 'だします', 'こうし', 'おおくの', 'さくひん', 'さっか', 'かつどう', 'それでは', 'おります', 'わたくし', 'ガイド', 'おたく', 'こうがい', 'アルバム', 'はんとし', 'さいごに', 'ただいま', 'とります', 'しぜん', 'きりん', 'ぞう', 'ころ', 'おれい', 'はいけい', 'けいぐ']
  }),
  methods: {
    Geet () {
      this.wordList = this.wordDict.slice().sort(function () { return Math.random() - 0.5 }).slice(0, 3)
    },
    Oppen () {
      const targ = `${this.wordList[0]}。${this.wordList[1]}。${this.wordList[2]}`
      window.open(`https://what3words.com/${targ}`, '_blank')
    }
    //
  },
  watch: {
    // textVal: function () {
    //   const text = this.textVal
    //   if (!text) {
    //     this.textCount = 0
    //     this.textRCount = 0
    //     this.textECount = 0
    //     return
    //   }
    //   this.textCount = text.replace(/\r?\n/g, '').replace(/\s+/g, '').length
    //   this.textRCount = text.length
    //   this.textECount = text.match(/\S+/g).length
    // }
  }
}
</script>

<style>
</style>
